# StairGetConfigType

## Description
Returns Stair Configuration Type.

```pascal
FUNCTION StairGetConfigType(stair : HANDLE) : INTEGER;
```

```python

def vs.StairGetConfigType(stair):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs